Контрольні питання
1 В чому суть патерна “Делегування подій” (Event Delegation) у порівнянні з розвішуванням addEventListener на 100 кнопок окремо? Які об’єкти / методи JavaScript роблять це можливим?

2 Якими методами можна знайти елемент в масиві за якоюсь властивістю (напр. по ID)? Яка між ними різниця?

3 Що таке Spread-оператор (...) і навіщо ми використали { ...product, quantity: 1 } при додаванні нового товару в кошик? Що буде, якщо ми не використаємо Spread?

4 Опишіть словами аргументи функції reduce((total, item) => total + item.price, 0). Що таке total, звідки він береться і навіщо потрібен , 0 у кінці?

5 Змінна let cart = [] зберігає дані під час запуску скрипта. Що станеться, якщо користувач натисне F5 (Оновити сторінку)? Чи залишиться інформація? Як розв’язати цю проблему у браузері?